app/views/posts/_post.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <th>
    <%= "#{post.user.first_name} #{post.user.last_name}"%>