app/controllers/posts_controller.rb

INSERT INTO "posts" ("date", "rationale", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["date", "2022-06-15"], ["rationale", "testes"], ["created_at", "2022-06-15 15:15:42.337739"], ["updated_at", "2022-06-15 15:15:42.337739"], ["user_id", 1]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    if @post.save

UPDATE "posts" SET "rationale" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["rationale", "Edited content"], ["updated_at", "2022-06-15 01:01:42.271216"], ["id", 4]]
---
  def update
    if @post.update(post_params)